MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/gpio.h
/*
 * Component description for GPIO
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-10-17T09:05:02Z */
#ifndef _BZ45_GPIO_COMPONENT_H_
#define _BZ45_GPIO_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR GPIO                                         */
/* ************************************************************************** */

/* -------- GPIO_ANSEL : (GPIO Offset: 0x00) (R/W 32)  -------- */
#define GPIO_ANSEL_RESETVALUE                 _UINT32_(0x00)                                       /*  (GPIO_ANSEL)   Reset Value */

#define GPIO_ANSEL_ANS0_Pos                   _UINT32_(0)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS0_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS0_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS0(value)                (GPIO_ANSEL_ANS0_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS0_Pos)) /* Assigment of value for ANS0 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS1_Pos                   _UINT32_(1)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS1_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS1_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS1(value)                (GPIO_ANSEL_ANS1_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS1_Pos)) /* Assigment of value for ANS1 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS2_Pos                   _UINT32_(2)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS2_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS2_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS2(value)                (GPIO_ANSEL_ANS2_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS2_Pos)) /* Assigment of value for ANS2 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS3_Pos                   _UINT32_(3)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS3_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS3_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS3(value)                (GPIO_ANSEL_ANS3_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS3_Pos)) /* Assigment of value for ANS3 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS4_Pos                   _UINT32_(4)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS4_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS4_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS4(value)                (GPIO_ANSEL_ANS4_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS4_Pos)) /* Assigment of value for ANS4 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS5_Pos                   _UINT32_(5)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS5_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS5_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS5(value)                (GPIO_ANSEL_ANS5_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS5_Pos)) /* Assigment of value for ANS5 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS6_Pos                   _UINT32_(6)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS6_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS6_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS6(value)                (GPIO_ANSEL_ANS6_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS6_Pos)) /* Assigment of value for ANS6 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS7_Pos                   _UINT32_(7)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS7_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS7_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS7(value)                (GPIO_ANSEL_ANS7_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS7_Pos)) /* Assigment of value for ANS7 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS8_Pos                   _UINT32_(8)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS8_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS8_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS8(value)                (GPIO_ANSEL_ANS8_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS8_Pos)) /* Assigment of value for ANS8 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS9_Pos                   _UINT32_(9)                                          /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS9_Msk                   (_UINT32_(0x1) << GPIO_ANSEL_ANS9_Pos)               /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS9(value)                (GPIO_ANSEL_ANS9_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS9_Pos)) /* Assigment of value for ANS9 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS10_Pos                  _UINT32_(10)                                         /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS10_Msk                  (_UINT32_(0x1) << GPIO_ANSEL_ANS10_Pos)              /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS10(value)               (GPIO_ANSEL_ANS10_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS10_Pos)) /* Assigment of value for ANS10 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS11_Pos                  _UINT32_(11)                                         /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS11_Msk                  (_UINT32_(0x1) << GPIO_ANSEL_ANS11_Pos)              /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS11(value)               (GPIO_ANSEL_ANS11_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS11_Pos)) /* Assigment of value for ANS11 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS12_Pos                  _UINT32_(12)                                         /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS12_Msk                  (_UINT32_(0x1) << GPIO_ANSEL_ANS12_Pos)              /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS12(value)               (GPIO_ANSEL_ANS12_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS12_Pos)) /* Assigment of value for ANS12 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS13_Pos                  _UINT32_(13)                                         /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS13_Msk                  (_UINT32_(0x1) << GPIO_ANSEL_ANS13_Pos)              /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS13(value)               (GPIO_ANSEL_ANS13_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS13_Pos)) /* Assigment of value for ANS13 in the GPIO_ANSEL register */
#define GPIO_ANSEL_ANS14_Pos                  _UINT32_(14)                                         /* (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS14_Msk                  (_UINT32_(0x1) << GPIO_ANSEL_ANS14_Pos)              /* (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS14(value)               (GPIO_ANSEL_ANS14_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS14_Pos)) /* Assigment of value for ANS14 in the GPIO_ANSEL register */
#define GPIO_ANSEL_Msk                        _UINT32_(0x00007FFF)                                 /* (GPIO_ANSEL) Register Mask  */

#define GPIO_ANSEL_ANS_Pos                    _UINT32_(0)                                          /* (GPIO_ANSEL Position)  */
#define GPIO_ANSEL_ANS_Msk                    (_UINT32_(0x7FFF) << GPIO_ANSEL_ANS_Pos)             /* (GPIO_ANSEL Mask) ANS */
#define GPIO_ANSEL_ANS(value)                 (GPIO_ANSEL_ANS_Msk & (_UINT32_(value) << GPIO_ANSEL_ANS_Pos)) 

/* -------- GPIO_ANSELCLR : (GPIO Offset: 0x04) (R/W 32)  -------- */
#define GPIO_ANSELCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_ANSELCLR)   Reset Value */

#define GPIO_ANSELCLR_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_ANSELCLR) Register Mask  */


