MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/gpio.h
#define GPIO_CNPD_CNPD_Pos                    _UINT32_(0)                                          /* (GPIO_CNPD Position)  */
#define GPIO_CNPD_CNPD_Msk                    (_UINT32_(0x7FFF) << GPIO_CNPD_CNPD_Pos)             /* (GPIO_CNPD Mask) CNPD */
#define GPIO_CNPD_CNPD(value)                 (GPIO_CNPD_CNPD_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD_Pos)) 

/* -------- GPIO_CNPDCLR : (GPIO Offset: 0x64) (R/W 32)  -------- */
#define GPIO_CNPDCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPDCLR)   Reset Value */

#define GPIO_CNPDCLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPDCLR) Register Mask  */


/* -------- GPIO_CNPDSET : (GPIO Offset: 0x68) (R/W 32)  -------- */
#define GPIO_CNPDSET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPDSET)   Reset Value */

#define GPIO_CNPDSET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPDSET) Register Mask  */


/* -------- GPIO_CNPDINV : (GPIO Offset: 0x6C) (R/W 32)  -------- */
#define GPIO_CNPDINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPDINV)   Reset Value */

#define GPIO_CNPDINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPDINV) Register Mask  */


/* -------- GPIO_CNCON : (GPIO Offset: 0x70) (R/W 32)  -------- */
#define GPIO_CNCON_RESETVALUE                 _UINT32_(0x00)                                       /*  (GPIO_CNCON)   Reset Value */

#define GPIO_CNCON_EDGEDETECT_Pos             _UINT32_(11)                                         /* (GPIO_CNCON)  Position */
#define GPIO_CNCON_EDGEDETECT_Msk             (_UINT32_(0x1) << GPIO_CNCON_EDGEDETECT_Pos)         /* (GPIO_CNCON)  Mask */
#define GPIO_CNCON_EDGEDETECT(value)          (GPIO_CNCON_EDGEDETECT_Msk & (_UINT32_(value) << GPIO_CNCON_EDGEDETECT_Pos)) /* Assigment of value for EDGEDETECT in the GPIO_CNCON register */
#define GPIO_CNCON_SIDL_Pos                   _UINT32_(13)                                         /* (GPIO_CNCON)  Position */
#define GPIO_CNCON_SIDL_Msk                   (_UINT32_(0x1) << GPIO_CNCON_SIDL_Pos)               /* (GPIO_CNCON)  Mask */
#define GPIO_CNCON_SIDL(value)                (GPIO_CNCON_SIDL_Msk & (_UINT32_(value) << GPIO_CNCON_SIDL_Pos)) /* Assigment of value for SIDL in the GPIO_CNCON register */
#define GPIO_CNCON_FRZ_Pos                    _UINT32_(14)                                         /* (GPIO_CNCON)  Position */
#define GPIO_CNCON_FRZ_Msk                    (_UINT32_(0x1) << GPIO_CNCON_FRZ_Pos)                /* (GPIO_CNCON)  Mask */
#define GPIO_CNCON_FRZ(value)                 (GPIO_CNCON_FRZ_Msk & (_UINT32_(value) << GPIO_CNCON_FRZ_Pos)) /* Assigment of value for FRZ in the GPIO_CNCON register */
#define GPIO_CNCON_ON_Pos                     _UINT32_(15)                                         /* (GPIO_CNCON)  Position */
#define GPIO_CNCON_ON_Msk                     (_UINT32_(0x1) << GPIO_CNCON_ON_Pos)                 /* (GPIO_CNCON)  Mask */
#define GPIO_CNCON_ON(value)                  (GPIO_CNCON_ON_Msk & (_UINT32_(value) << GPIO_CNCON_ON_Pos)) /* Assigment of value for ON in the GPIO_CNCON register */
#define GPIO_CNCON_Msk                        _UINT32_(0x0000E800)                                 /* (GPIO_CNCON) Register Mask  */


/* -------- GPIO_CNCONCLR : (GPIO Offset: 0x74) (R/W 32)  -------- */
#define GPIO_CNCONCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_CNCONCLR)   Reset Value */

#define GPIO_CNCONCLR_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_CNCONCLR) Register Mask  */


/* -------- GPIO_CNCONSET : (GPIO Offset: 0x78) (R/W 32)  -------- */
#define GPIO_CNCONSET_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_CNCONSET)   Reset Value */

#define GPIO_CNCONSET_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_CNCONSET) Register Mask  */


/* -------- GPIO_CNCONINV : (GPIO Offset: 0x7C) (R/W 32)  -------- */
#define GPIO_CNCONINV_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_CNCONINV)   Reset Value */

#define GPIO_CNCONINV_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_CNCONINV) Register Mask  */


/* -------- GPIO_CNEN : (GPIO Offset: 0x80) (R/W 32)  -------- */
#define GPIO_CNEN_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_CNEN)   Reset Value */

#define GPIO_CNEN_CNIE0_Pos                   _UINT32_(0)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE0_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE0_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE0(value)                (GPIO_CNEN_CNIE0_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE0_Pos)) /* Assigment of value for CNIE0 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE1_Pos                   _UINT32_(1)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE1_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE1_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE1(value)                (GPIO_CNEN_CNIE1_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE1_Pos)) /* Assigment of value for CNIE1 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE2_Pos                   _UINT32_(2)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE2_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE2_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE2(value)                (GPIO_CNEN_CNIE2_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE2_Pos)) /* Assigment of value for CNIE2 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE3_Pos                   _UINT32_(3)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE3_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE3_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE3(value)                (GPIO_CNEN_CNIE3_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE3_Pos)) /* Assigment of value for CNIE3 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE4_Pos                   _UINT32_(4)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE4_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE4_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE4(value)                (GPIO_CNEN_CNIE4_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE4_Pos)) /* Assigment of value for CNIE4 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE5_Pos                   _UINT32_(5)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE5_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE5_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE5(value)                (GPIO_CNEN_CNIE5_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE5_Pos)) /* Assigment of value for CNIE5 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE6_Pos                   _UINT32_(6)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE6_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE6_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE6(value)                (GPIO_CNEN_CNIE6_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE6_Pos)) /* Assigment of value for CNIE6 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE7_Pos                   _UINT32_(7)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE7_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE7_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE7(value)                (GPIO_CNEN_CNIE7_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE7_Pos)) /* Assigment of value for CNIE7 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE8_Pos                   _UINT32_(8)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE8_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE8_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE8(value)                (GPIO_CNEN_CNIE8_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE8_Pos)) /* Assigment of value for CNIE8 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE9_Pos                   _UINT32_(9)                                          /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE9_Msk                   (_UINT32_(0x1) << GPIO_CNEN_CNIE9_Pos)               /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE9(value)                (GPIO_CNEN_CNIE9_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE9_Pos)) /* Assigment of value for CNIE9 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE10_Pos                  _UINT32_(10)                                         /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE10_Msk                  (_UINT32_(0x1) << GPIO_CNEN_CNIE10_Pos)              /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE10(value)               (GPIO_CNEN_CNIE10_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE10_Pos)) /* Assigment of value for CNIE10 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE11_Pos                  _UINT32_(11)                                         /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE11_Msk                  (_UINT32_(0x1) << GPIO_CNEN_CNIE11_Pos)              /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE11(value)               (GPIO_CNEN_CNIE11_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE11_Pos)) /* Assigment of value for CNIE11 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE12_Pos                  _UINT32_(12)                                         /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE12_Msk                  (_UINT32_(0x1) << GPIO_CNEN_CNIE12_Pos)              /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE12(value)               (GPIO_CNEN_CNIE12_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE12_Pos)) /* Assigment of value for CNIE12 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE13_Pos                  _UINT32_(13)                                         /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE13_Msk                  (_UINT32_(0x1) << GPIO_CNEN_CNIE13_Pos)              /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE13(value)               (GPIO_CNEN_CNIE13_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE13_Pos)) /* Assigment of value for CNIE13 in the GPIO_CNEN register */
#define GPIO_CNEN_CNIE14_Pos                  _UINT32_(14)                                         /* (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE14_Msk                  (_UINT32_(0x1) << GPIO_CNEN_CNIE14_Pos)              /* (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE14(value)               (GPIO_CNEN_CNIE14_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE14_Pos)) /* Assigment of value for CNIE14 in the GPIO_CNEN register */
#define GPIO_CNEN_Msk                         _UINT32_(0x00007FFF)                                 /* (GPIO_CNEN) Register Mask  */

#define GPIO_CNEN_CNIE_Pos                    _UINT32_(0)                                          /* (GPIO_CNEN Position)  */
#define GPIO_CNEN_CNIE_Msk                    (_UINT32_(0x7FFF) << GPIO_CNEN_CNIE_Pos)             /* (GPIO_CNEN Mask) CNIE */
#define GPIO_CNEN_CNIE(value)                 (GPIO_CNEN_CNIE_Msk & (_UINT32_(value) << GPIO_CNEN_CNIE_Pos)) 

/* -------- GPIO_CNENCLR : (GPIO Offset: 0x84) (R/W 32)  -------- */
#define GPIO_CNENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNENCLR)   Reset Value */

#define GPIO_CNENCLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNENCLR) Register Mask  */


/* -------- GPIO_CNENSET : (GPIO Offset: 0x88) (R/W 32)  -------- */
#define GPIO_CNENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNENSET)   Reset Value */

