MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/gpio.h
#define GPIO_CNENSET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNENSET) Register Mask  */


/* -------- GPIO_CNENINV : (GPIO Offset: 0x8C) (R/W 32)  -------- */
#define GPIO_CNENINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNENINV)   Reset Value */

#define GPIO_CNENINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNENINV) Register Mask  */


/* -------- GPIO_CNSTAT : (GPIO Offset: 0x90) (R/W 32)  -------- */
#define GPIO_CNSTAT_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_CNSTAT)   Reset Value */

#define GPIO_CNSTAT_CNSTAT0_Pos               _UINT32_(0)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT0_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT0_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT0(value)            (GPIO_CNSTAT_CNSTAT0_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT0_Pos)) /* Assigment of value for CNSTAT0 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT1_Pos               _UINT32_(1)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT1_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT1_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT1(value)            (GPIO_CNSTAT_CNSTAT1_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT1_Pos)) /* Assigment of value for CNSTAT1 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT2_Pos               _UINT32_(2)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT2_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT2_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT2(value)            (GPIO_CNSTAT_CNSTAT2_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT2_Pos)) /* Assigment of value for CNSTAT2 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT3_Pos               _UINT32_(3)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT3_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT3_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT3(value)            (GPIO_CNSTAT_CNSTAT3_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT3_Pos)) /* Assigment of value for CNSTAT3 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT4_Pos               _UINT32_(4)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT4_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT4_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT4(value)            (GPIO_CNSTAT_CNSTAT4_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT4_Pos)) /* Assigment of value for CNSTAT4 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT5_Pos               _UINT32_(5)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT5_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT5_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT5(value)            (GPIO_CNSTAT_CNSTAT5_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT5_Pos)) /* Assigment of value for CNSTAT5 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT6_Pos               _UINT32_(6)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT6_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT6_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT6(value)            (GPIO_CNSTAT_CNSTAT6_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT6_Pos)) /* Assigment of value for CNSTAT6 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT7_Pos               _UINT32_(7)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT7_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT7_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT7(value)            (GPIO_CNSTAT_CNSTAT7_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT7_Pos)) /* Assigment of value for CNSTAT7 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT8_Pos               _UINT32_(8)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT8_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT8_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT8(value)            (GPIO_CNSTAT_CNSTAT8_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT8_Pos)) /* Assigment of value for CNSTAT8 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTATA_Pos               _UINT32_(9)                                          /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTATA_Msk               (_UINT32_(0x1) << GPIO_CNSTAT_CNSTATA_Pos)           /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTATA(value)            (GPIO_CNSTAT_CNSTATA_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTATA_Pos)) /* Assigment of value for CNSTATA in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT10_Pos              _UINT32_(10)                                         /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT10_Msk              (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT10_Pos)          /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT10(value)           (GPIO_CNSTAT_CNSTAT10_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT10_Pos)) /* Assigment of value for CNSTAT10 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT11_Pos              _UINT32_(11)                                         /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT11_Msk              (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT11_Pos)          /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT11(value)           (GPIO_CNSTAT_CNSTAT11_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT11_Pos)) /* Assigment of value for CNSTAT11 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT12_Pos              _UINT32_(12)                                         /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT12_Msk              (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT12_Pos)          /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT12(value)           (GPIO_CNSTAT_CNSTAT12_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT12_Pos)) /* Assigment of value for CNSTAT12 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT13_Pos              _UINT32_(13)                                         /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT13_Msk              (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT13_Pos)          /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT13(value)           (GPIO_CNSTAT_CNSTAT13_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT13_Pos)) /* Assigment of value for CNSTAT13 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_CNSTAT14_Pos              _UINT32_(14)                                         /* (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT14_Msk              (_UINT32_(0x1) << GPIO_CNSTAT_CNSTAT14_Pos)          /* (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT14(value)           (GPIO_CNSTAT_CNSTAT14_Msk & (_UINT32_(value) << GPIO_CNSTAT_CNSTAT14_Pos)) /* Assigment of value for CNSTAT14 in the GPIO_CNSTAT register */
#define GPIO_CNSTAT_Msk                       _UINT32_(0x00007FFF)                                 /* (GPIO_CNSTAT) Register Mask  */


/* -------- GPIO_CNSTATCLR : (GPIO Offset: 0x94) (R/W 32)  -------- */
#define GPIO_CNSTATCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_CNSTATCLR)   Reset Value */

#define GPIO_CNSTATCLR_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_CNSTATCLR) Register Mask  */


