MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/gpio.h
/* -------- GPIO_CNSTATSET : (GPIO Offset: 0x98) (R/W 32)  -------- */
#define GPIO_CNSTATSET_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_CNSTATSET)   Reset Value */

#define GPIO_CNSTATSET_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_CNSTATSET) Register Mask  */


/* -------- GPIO_CNSTATINV : (GPIO Offset: 0x9C) (R/W 32)  -------- */
#define GPIO_CNSTATINV_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_CNSTATINV)   Reset Value */

#define GPIO_CNSTATINV_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_CNSTATINV) Register Mask  */


/* -------- GPIO_CNNE : (GPIO Offset: 0xA0) (R/W 32)  -------- */
#define GPIO_CNNE_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_CNNE)   Reset Value */

#define GPIO_CNNE_CNNE0_Pos                   _UINT32_(0)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE0_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE0_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE0(value)                (GPIO_CNNE_CNNE0_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE0_Pos)) /* Assigment of value for CNNE0 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE1_Pos                   _UINT32_(1)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE1_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE1_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE1(value)                (GPIO_CNNE_CNNE1_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE1_Pos)) /* Assigment of value for CNNE1 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE2_Pos                   _UINT32_(2)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE2_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE2_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE2(value)                (GPIO_CNNE_CNNE2_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE2_Pos)) /* Assigment of value for CNNE2 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE3_Pos                   _UINT32_(3)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE3_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE3_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE3(value)                (GPIO_CNNE_CNNE3_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE3_Pos)) /* Assigment of value for CNNE3 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE4_Pos                   _UINT32_(4)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE4_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE4_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE4(value)                (GPIO_CNNE_CNNE4_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE4_Pos)) /* Assigment of value for CNNE4 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE5_Pos                   _UINT32_(5)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE5_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE5_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE5(value)                (GPIO_CNNE_CNNE5_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE5_Pos)) /* Assigment of value for CNNE5 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE6_Pos                   _UINT32_(6)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE6_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE6_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE6(value)                (GPIO_CNNE_CNNE6_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE6_Pos)) /* Assigment of value for CNNE6 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE7_Pos                   _UINT32_(7)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE7_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE7_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE7(value)                (GPIO_CNNE_CNNE7_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE7_Pos)) /* Assigment of value for CNNE7 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE8_Pos                   _UINT32_(8)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE8_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE8_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE8(value)                (GPIO_CNNE_CNNE8_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE8_Pos)) /* Assigment of value for CNNE8 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE9_Pos                   _UINT32_(9)                                          /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE9_Msk                   (_UINT32_(0x1) << GPIO_CNNE_CNNE9_Pos)               /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE9(value)                (GPIO_CNNE_CNNE9_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE9_Pos)) /* Assigment of value for CNNE9 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE10_Pos                  _UINT32_(10)                                         /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE10_Msk                  (_UINT32_(0x1) << GPIO_CNNE_CNNE10_Pos)              /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE10(value)               (GPIO_CNNE_CNNE10_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE10_Pos)) /* Assigment of value for CNNE10 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE11_Pos                  _UINT32_(11)                                         /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE11_Msk                  (_UINT32_(0x1) << GPIO_CNNE_CNNE11_Pos)              /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE11(value)               (GPIO_CNNE_CNNE11_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE11_Pos)) /* Assigment of value for CNNE11 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE12_Pos                  _UINT32_(12)                                         /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE12_Msk                  (_UINT32_(0x1) << GPIO_CNNE_CNNE12_Pos)              /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE12(value)               (GPIO_CNNE_CNNE12_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE12_Pos)) /* Assigment of value for CNNE12 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE13_Pos                  _UINT32_(13)                                         /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE13_Msk                  (_UINT32_(0x1) << GPIO_CNNE_CNNE13_Pos)              /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE13(value)               (GPIO_CNNE_CNNE13_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE13_Pos)) /* Assigment of value for CNNE13 in the GPIO_CNNE register */
#define GPIO_CNNE_CNNE14_Pos                  _UINT32_(14)                                         /* (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE14_Msk                  (_UINT32_(0x1) << GPIO_CNNE_CNNE14_Pos)              /* (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE14(value)               (GPIO_CNNE_CNNE14_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE14_Pos)) /* Assigment of value for CNNE14 in the GPIO_CNNE register */
#define GPIO_CNNE_Msk                         _UINT32_(0x00007FFF)                                 /* (GPIO_CNNE) Register Mask  */

#define GPIO_CNNE_CNNE_Pos                    _UINT32_(0)                                          /* (GPIO_CNNE Position)  */
#define GPIO_CNNE_CNNE_Msk                    (_UINT32_(0x7FFF) << GPIO_CNNE_CNNE_Pos)             /* (GPIO_CNNE Mask) CNNE */
#define GPIO_CNNE_CNNE(value)                 (GPIO_CNNE_CNNE_Msk & (_UINT32_(value) << GPIO_CNNE_CNNE_Pos)) 

